In [4]:
import pandas as pd, requests

In [5]:
response = requests.get('http://api.open-notify.org/astros.json')
print(response.status_code)

200

In [6]:
# Return the raw bytes of the data payload
# response.content()

# Return a string representation of the data payload
# response.text()

# This method is convenient when the API returns JSON
data = response.json()

In [ ]:
type(response.json())

dict

# Data Processing

## Looping

In [7]:
data

{'people': [{'name': 'Mark Vande Hei', 'craft': 'ISS'},
  {'name': 'Oleg Novitskiy', 'craft': 'ISS'},
  {'name': 'Pyotr Dubrov', 'craft': 'ISS'},
  {'name': 'Thomas Pesquet', 'craft': 'ISS'},
  {'name': 'Megan McArthur', 'craft': 'ISS'},
  {'name': 'Shane Kimbrough', 'craft': 'ISS'},
  {'name': 'Akihiko Hoshide', 'craft': 'ISS'},
  {'name': 'Nie Haisheng', 'craft': 'Tiangong'},
  {'name': 'Liu Boming', 'craft': 'Tiangong'},
  {'name': 'Tang Hongbo', 'craft': 'Tiangong'}],
 'number': 10,
 'message': 'success'}

In [ ]:
message = data['message']
number = data['number']
people = data['people']

processed_data = []
for person in people:
    craft = person['craft']
    name = person['name']
    processed_data.append([message, number, craft, name])

print(processed_data)

[['success', 7, 'ISS', 'Sergey Ryzhikov'], ['success', 7, 'ISS', 'Kate Rubins'], ['success', 7, 'ISS', 'Sergey Kud-Sverchkov'], ['success', 7, 'ISS', 'Mike Hopkins'], ['success', 7, 'ISS', 'Victor Glover'], ['success', 7, 'ISS', 'Shannon Walker'], ['success', 7, 'ISS', 'Soichi Noguchi']]

In [ ]:
df1 = pd.DataFrame(processed_data, columns=['message', 'number', 'craft', 'name'])
df1

   message  number craft                  name
0  success       7   ISS       Sergey Ryzhikov
1  success       7   ISS           Kate Rubins
2  success       7   ISS  Sergey Kud-Sverchkov
3  success       7   ISS          Mike Hopkins
4  success       7   ISS         Victor Glover
5  success       7   ISS        Shannon Walker
6  success       7   ISS        Soichi Noguchi

## Pandas Cross Join

In [ ]:
df2 = pd.DataFrame(data)
df2

   message  number                                            people
0  success       7       {'craft': 'ISS', 'name': 'Sergey Ryzhikov'}
1  success       7           {'craft': 'ISS', 'name': 'Kate Rubins'}
2  success       7  {'craft': 'ISS', 'name': 'Sergey Kud-Sverchkov'}
3  success       7          {'craft': 'ISS', 'name': 'Mike Hopkins'}
4  success       7         {'craft': 'ISS', 'name': 'Victor Glover'}
5  success       7        {'craft': 'ISS', 'name': 'Shannon Walker'}
6  success       7        {'craft': 'ISS', 'name': 'Soichi Noguchi'}

In [ ]:
tb1 = df2[['message', 'number']]
tb1 = tb1.drop_duplicates()
tb1

   message  number
0  success       7

In [ ]:
tb2 = pd.DataFrame(data['people'], columns=['craft', 'name'])
tb2

  craft                  name
0   ISS       Sergey Ryzhikov
1   ISS           Kate Rubins
2   ISS  Sergey Kud-Sverchkov
3   ISS          Mike Hopkins
4   ISS         Victor Glover
5   ISS        Shannon Walker
6   ISS        Soichi Noguchi

In [ ]:
# Now to perform cross join, we will create a key column in both the DataFrames to merge on that key. 
tb1['key'] = 1
tb2['key'] = 1

In [ ]:
# Perform Cross Join
df2 = pd.merge(tb1, tb2, on ='key').drop("key", 1) 
df2

   message  number craft                  name
0  success       7   ISS       Sergey Ryzhikov
1  success       7   ISS           Kate Rubins
2  success       7   ISS  Sergey Kud-Sverchkov
3  success       7   ISS          Mike Hopkins
4  success       7   ISS         Victor Glover
5  success       7   ISS        Shannon Walker
6  success       7   ISS        Soichi Noguchi

# Alphavantage

In [ ]:
queries = {'apikey': 'XVV7I3GHUW42LTO4',
            'function': 'TIME_SERIES_INTRADAY',
            'symbol': 'IBM',
            'interval': '5min'}
response = requests.get('https://www.alphavantage.co/query?', params=queries,)
response.status_code

200

In [ ]:
json_data = response.json()
json_data

{'Meta Data': {'1. Information': 'Intraday (5min) open, high, low, close prices and volume',
  '2. Symbol': 'IBM',
  '3. Last Refreshed': '2021-02-19 18:45:00',
  '4. Interval': '5min',
  '5. Output Size': 'Compact',
  '6. Time Zone': 'US/Eastern'},
 'Time Series (5min)': {'2021-02-19 09:10:00': {'1. open': '121.0500',
   '2. high': '121.0500',
   '3. low': '121.0500',
   '4. close': '121.0500',
   '5. volume': '109'},
  '2021-02-19 09:15:00': {'1. open': '121.1000',
   '2. high': '121.1000',
   '3. low': '121.0500',
   '4. close': '121.0500',
   '5. volume': '878'},
  '2021-02-19 09:20:00': {'1. open': '121.0800',
   '2. high': '121.1300',
   '3. low': '121.0800',
   '4. close': '121.1200',
   '5. volume': '4871'},
  '2021-02-19 09:25:00': {'1. open': '121.0500',
   '2. high': '121.1300',
   '3. low': '121.0500',
   '4. close': '121.1300',
   '5. volume': '1628'},
  '2021-02-19 09:30:00': {'1. open': '121.0700',
   '2. high': '121.1100',
   '3. low': '120.8000',
   '4. close': '120.8000',
   '5. volume': '9704'},
  '2021-02-19 09:35:00': {'1. open': '120.7500',
   '2. high': '120.7600',
   '3. low': '120.0100',
   '4. close': '120.0100',
   '5. volume': '493791'},
  '2021-02-19 09:40:00': {'1. open': '120.0000',
   '2. high': '120.0000',
   '3. low': '119.7000',
   '4. close': '119.7400',
   '5. volume': '100106'},
  '2021-02-19 09:45:00': {'1. open': '119.7300',
   '2. high': '119.7300',
   '3. low': '119.3903',
   '4. close': '119.5700',
   '5. volume': '109470'},
  '2021-02-19 09:50:00': {'1. open': '119.5500',
   '2. high': '119.8300',
   '3. low': '119.5492',
   '4. close': '119.6450',
   '5. volume': '58851'},
  '2021-02-19 09:55:00': {'1. open': '119.6450',
   '2. high': '120.7500',
   '3. low': '119.4000',
   '4. close': '119.4200',
   '5. volume': '540834'},
  '2021-02-19 10:00:00': {'1. open': '119.4100',
   '2. high': '119.5400',
   '3. low': '119.2100',
   '4. close': '119.4350',
   '5. volume': '117307'},
  '2021-02-19 10:05:00': {'1. open': '119.4500',
   '2. high': '119.7400',
   '3. low': '119.4500',
   '4. close': '119.5500',
   '5. volume': '52127'},
  '2021-02-19 10:10:00': {'1. open': '119.5500',
   '2. high': '119.8500',
   '3. low': '119.5500',
   '4. close': '119.7200',
   '5. volume': '52963'},
  '2021-02-19 10:15:00': {'1. open': '119.7100',
   '2. high': '119.7300',
   '3. low': '119.5500',
   '4. close': '119.5600',
   '5. volume': '47794'},
  '2021-02-19 10:20:00': {'1. open': '119.5600',
   '2. high': '119.5700',
   '3. low': '119.3800',
   '4. close': '119.5300',
   '5. volume': '78813'},
  '2021-02-19 10:25:00': {'1. open': '119.5500',
   '2. high': '119.7500',
   '3. low': '119.5200',
   '4. close': '119.7300',
   '5. volume': '47833'},
  '2021-02-19 10:30:00': {'1. open': '119.7390',
   '2. high': '119.9550',
   '3. low': '119.7390',
   '4. close': '119.7400',
   '5. volume': '76683'},
  '2021-02-19 10:35:00': {'1. open': '119.7100',
   '2. high': '119.8499',
   '3. low': '119.6600',
   '4. close': '119.7700',
   '5. volume': '39711'},
  '2021-02-19 10:40:00': {'1. open': '119.7500',
   '2. high': '119.8000',
   '3. low': '119.5400',
   '4. close': '119.6300',
   '5. volume': '27842'},
  '2021-02-19 10:45:00': {'1. open': '119.6264',
   '2. high': '119.7400',
   '3. low': '119.4900',
   '4. close': '119.5000',
   '5. volume': '110506'},
  '2021-02-19 10:50:00': {'1. open': '119.5173',
   '2. high': '119.6200',
   '3. low': '119.4200',
   '4. close': '119.4200',
   '5. volume': '65616'},
  '2021-02-19 10:55:00': {'1. open': '119.4300',
   '2. high': '119.6000',
   '3. low': '119.4300',
   '4. close': '119.4800',
   '5. volume': '62950'},
  '2021-02-19 11:00:00': {'1. open': '119.4800',
   '2. high': '119.5400',
   '3. low': '119.4300',
   '4. close': '119.4500',
   '5. volume': '68017'},
  '2021-02-19 11:05:00': {'1. open': '119.4400',
   '2. high': '119.5200',
   '3. low': '119.3980',
   '4. close': '119.4550',
   '5. volume': '40431'},
  '2021-02-19 11:10:00': {'1. open': '119.4550',
   '2. high': '119.5700',
   '3. low': '119.3500',
   '4. close': '119.4200',
   '5. volume': '83166'},
  '2021-02-19 11:15:00': {'1. open': '119.4100',
   '2. high': '119.4800',
   '3. low': '119.3300',
   '4. close': '119.4600',
   '5. volume': '65143'},
  '2021-02-19 11:20:00': {'1. open': '119.4600',
   '2. high': '119.5400',
   '3. low': '119.3300',
   '4. close': '119.3550',
   '5. volume': '55212'},
  '2021-02-19 11:25:00': {'1. open': '119.3550',
   '2. high': '119.7000',
   '3. low': '119.3422',
   '4. close': '119.6150',
   '5. volume': '75625'},
  '2021-02-19 11:30:00': {'1. open': '119.6100',
   '2. high': '119.6800',
   '3. low': '119.5500',
   '4. close': '119.6800',
   '5. volume': '34086'},
  '2021-02-19 11:35:00': {'1. open': '119.6500',
   '2. high': '119.6850',
   '3. low': '119.5400',
   '4. close': '119.5657',
   '5. volume': '41723'},
  '2021-02-19 11:40:00': {'1. open': '119.5650',
   '2. high': '119.6400',
   '3. low': '119.5600',
   '4. close': '119.5800',
   '5. volume': '30541'},
  '2021-02-19 11:45:00': {'1. open': '119.5850',
   '2. high': '119.7400',
   '3. low': '119.5850',
   '4. close': '119.6900',
   '5. volume': '39318'},
  '2021-02-19 11:50:00': {'1. open': '119.6720',
   '2. high': '119.7312',
   '3. low': '119.6400',
   '4. close': '119.7100',
   '5. volume': '41486'},
  '2021-02-19 11:55:00': {'1. open': '119.7000',
   '2. high': '119.7500',
   '3. low': '119.6100',
   '4. close': '119.7500',
   '5. volume': '24937'},
  '2021-02-19 12:00:00': {'1. open': '119.7500',
   '2. high': '119.7900',
   '3. low': '119.7000',
   '4. close': '119.7400',
   '5. volume': '26329'},
  '2021-02-19 12:05:00': {'1. open': '119.7360',
   '2. high': '119.8100',
   '3. low': '119.6750',
   '4. close': '119.8000',
   '5. volume': '27725'},
  '2021-02-19 12:10:00': {'1. open': '119.8000',
   '2. high': '119.8278',
   '3. low': '119.7000',
   '4. close': '119.7700',
   '5. volume': '30686'},
  '2021-02-19 12:15:00': {'1. open': '119.7600',
   '2. high': '119.7600',
   '3. low': '119.6900',
   '4. close': '119.7000',
   '5. volume': '35075'},
  '2021-02-19 12:20:00': {'1. open': '119.7200',
   '2. high': '119.7500',
   '3. low': '119.5800',
   '4. close': '119.5800',
   '5. volume': '35236'},
  '2021-02-19 12:25:00': {'1. open': '119.5700',
   '2. high': '119.6000',
   '3. low': '119.4300',
   '4. close': '119.4500',
   '5. volume': '47085'},
  '2021-02-19 12:30:00': {'1. open': '119.4290',
   '2. high': '119.4600',
   '3. low': '119.3100',
   '4. close': '119.3600',
   '5. volume': '79356'},
  '2021-02-19 12:35:00': {'1. open': '119.3650',
   '2. high': '119.4628',
   '3. low': '119.2900',
   '4. close': '119.3000',
   '5. volume': '91788'},
  '2021-02-19 12:40:00': {'1. open': '119.3000',
   '2. high': '119.3300',
   '3. low': '119.2450',
   '4. close': '119.2900',
   '5. volume': '60472'},
  '2021-02-19 12:45:00': {'1. open': '119.2700',
   '2. high': '119.2700',
   '3. low': '119.0500',
   '4. close': '119.1600',
   '5. volume': '112923'},
  '2021-02-19 12:50:00': {'1. open': '119.1500',
   '2. high': '119.1650',
   '3. low': '118.9600',
   '4. close': '119.0400',
   '5. volume': '162927'},
  '2021-02-19 12:55:00': {'1. open': '119.0292',
   '2. high': '119.0400',
   '3. low': '118.8500',
   '4. close': '118.9800',
   '5. volume': '75981'},
  '2021-02-19 13:00:00': {'1. open': '119.0135',
   '2. high': '119.0700',
   '3. low': '118.9638',
   '4. close': '118.9638',
   '5. volume': '80560'},
  '2021-02-19 13:05:00': {'1. open': '118.9600',
   '2. high': '119.0300',
   '3. low': '118.9550',
   '4. close': '118.9906',
   '5. volume': '45437'},
  '2021-02-19 13:10:00': {'1. open': '119.0000',
   '2. high': '119.0100',
   '3. low': '118.8700',
   '4. close': '118.8715',
   '5. volume': '38776'},
  '2021-02-19 13:15:00': {'1. open': '118.8700',
   '2. high': '119.0199',
   '3. low': '118.8500',
   '4. close': '119.0000',
   '5. volume': '46746'},
  '2021-02-19 13:20:00': {'1. open': '119.0000',
   '2. high': '119.1400',
   '3. low': '118.9800',
   '4. close': '119.0500',
   '5. volume': '48384'},
  '2021-02-19 13:25:00': {'1. open': '119.0500',
   '2. high': '119.0700',
   '3. low': '118.9600',
   '4. close': '119.0000',
   '5. volume': '42103'},
  '2021-02-19 13:30:00': {'1. open': '118.9650',
   '2. high': '119.0000',
   '3. low': '118.9101',
   '4. close': '118.9101',
   '5. volume': '56548'},
  '2021-02-19 13:35:00': {'1. open': '118.9205',
   '2. high': '118.9300',
   '3. low': '118.8022',
   '4. close': '118.8399',
   '5. volume': '90935'},
  '2021-02-19 13:40:00': {'1. open': '118.8300',
   '2. high': '118.8500',
   '3. low': '118.7600',
   '4. close': '118.8050',
   '5. volume': '92586'},
  '2021-02-19 13:45:00': {'1. open': '118.8000',
   '2. high': '118.8800',
   '3. low': '118.7850',
   '4. close': '118.8700',
   '5. volume': '54080'},
  '2021-02-19 13:50:00': {'1. open': '118.8750',
   '2. high': '118.9400',
   '3. low': '118.8100',
   '4. close': '118.8100',
   '5. volume': '81988'},
  '2021-02-19 13:55:00': {'1. open': '118.8072',
   '2. high': '118.8400',
   '3. low': '118.7800',
   '4. close': '118.8311',
   '5. volume': '45774'},
  '2021-02-19 14:00:00': {'1. open': '118.8350',
   '2. high': '118.9000',
   '3. low': '118.7800',
   '4. close': '118.8050',
   '5. volume': '49511'},
  '2021-02-19 14:05:00': {'1. open': '118.8100',
   '2. high': '118.8800',
   '3. low': '118.8050',
   '4. close': '118.8400',
   '5. volume': '32933'},
  '2021-02-19 14:10:00': {'1. open': '118.8400',
   '2. high': '118.9200',
   '3. low': '118.7700',
   '4. close': '118.8500',
   '5. volume': '73226'},
  '2021-02-19 14:15:00': {'1. open': '118.8350',
   '2. high': '118.8918',
   '3. low': '118.7800',
   '4. close': '118.8100',
   '5. volume': '43680'},
  '2021-02-19 14:20:00': {'1. open': '118.8100',
   '2. high': '118.8900',
   '3. low': '118.7950',
   '4. close': '118.8250',
   '5. volume': '66324'},
  '2021-02-19 14:25:00': {'1. open': '118.8250',
   '2. high': '118.8450',
   '3. low': '118.7050',
   '4. close': '118.7700',
   '5. volume': '138553'},
  '2021-02-19 14:30:00': {'1. open': '118.7750',
   '2. high': '118.8000',
   '3. low': '118.6300',
   '4. close': '118.6300',
   '5. volume': '101589'},
  '2021-02-19 14:35:00': {'1. open': '118.6300',
   '2. high': '118.7645',
   '3. low': '118.5600',
   '4. close': '118.5800',
   '5. volume': '94920'},
  '2021-02-19 14:40:00': {'1. open': '118.5700',
   '2. high': '118.6300',
   '3. low': '118.5500',
   '4. close': '118.5800',
   '5. volume': '35288'},
  '2021-02-19 14:45:00': {'1. open': '118.5800',
   '2. high': '118.5899',
   '3. low': '118.4200',
   '4. close': '118.4750',
   '5. volume': '128723'},
  '2021-02-19 14:50:00': {'1. open': '118.4750',
   '2. high': '118.4850',
   '3. low': '118.3800',
   '4. close': '118.4050',
   '5. volume': '75397'},
  '2021-02-19 14:55:00': {'1. open': '118.4000',
   '2. high': '118.5400',
   '3. low': '118.3900',
   '4. close': '118.5300',
   '5. volume': '46781'},
  '2021-02-19 15:00:00': {'1. open': '118.5281',
   '2. high': '118.6485',
   '3. low': '118.5050',
   '4. close': '118.6200',
   '5. volume': '52370'},
  '2021-02-19 15:05:00': {'1. open': '118.6200',
   '2. high': '118.8250',
   '3. low': '118.6100',
   '4. close': '118.8100',
   '5. volume': '69398'},
  '2021-02-19 15:10:00': {'1. open': '118.8000',
   '2. high': '118.9500',
   '3. low': '118.7800',
   '4. close': '118.9100',
   '5. volume': '72221'},
  '2021-02-19 15:15:00': {'1. open': '118.9100',
   '2. high': '119.0200',
   '3. low': '118.9050',
   '4. close': '119.0000',
   '5. volume': '58340'},
  '2021-02-19 15:20:00': {'1. open': '119.0100',
   '2. high': '119.0500',
   '3. low': '118.9374',
   '4. close': '119.0150',
   '5. volume': '41968'},
  '2021-02-19 15:25:00': {'1. open': '119.0100',
   '2. high': '119.0100',
   '3. low': '118.9100',
   '4. close': '118.9450',
   '5. volume': '35598'},
  '2021-02-19 15:30:00': {'1. open': '118.9350',
   '2. high': '119.0200',
   '3. low': '118.9300',
   '4. close': '119.0200',
   '5. volume': '54131'},
  '2021-02-19 15:35:00': {'1. open': '119.0200',
   '2. high': '119.1400',
   '3. low': '119.0000',
   '4. close': '119.0500',
   '5. volume': '80825'},
  '2021-02-19 15:40:00': {'1. open': '119.0500',
   '2. high': '119.1200',
   '3. low': '119.0000',
   '4. close': '119.0700',
   '5. volume': '63004'},
  '2021-02-19 15:45:00': {'1. open': '119.0800',
   '2. high': '119.1750',
   '3. low': '119.0702',
   '4. close': '119.1100',
   '5. volume': '75225'},
  '2021-02-19 15:50:00': {'1. open': '119.1000',
   '2. high': '119.2200',
   '3. low': '119.0800',
   '4. close': '119.0900',
   '5. volume': '102577'},
  '2021-02-19 15:55:00': {'1. open': '119.0900',
   '2. high': '119.1300',
   '3. low': '118.9400',
   '4. close': '118.9400',
   '5. volume': '111630'},
  '2021-02-19 16:00:00': {'1. open': '118.9400',
   '2. high': '119.0100',
   '3. low': '118.8100',
   '4. close': '118.9800',
   '5. volume': '225386'},
  '2021-02-19 16:05:00': {'1. open': '118.9900',
   '2. high': '119.0300',
   '3. low': '118.9900',
   '4. close': '118.9900',
   '5. volume': '78015'},
  '2021-02-19 16:10:00': {'1. open': '118.9000',
   '2. high': '118.9900',
   '3. low': '118.8999',
   '4. close': '118.9900',
   '5. volume': '25246'},
  '2021-02-19 16:15:00': {'1. open': '118.9000',
   '2. high': '118.9000',
   '3. low': '118.9000',
   '4. close': '118.9000',
   '5. volume': '838'},
  '2021-02-19 16:25:00': {'1. open': '118.9900',
   '2. high': '118.9900',
   '3. low': '118.9900',
   '4. close': '118.9900',
   '5. volume': '618'},
  '2021-02-19 16:35:00': {'1. open': '118.9600',
   '2. high': '118.9600',
   '3. low': '118.9600',
   '4. close': '118.9600',
   '5. volume': '222'},
  '2021-02-19 16:40:00': {'1. open': '118.9600',
   '2. high': '118.9600',
   '3. low': '118.9600',
   '4. close': '118.9600',
   '5. volume': '300'},
  '2021-02-19 16:45:00': {'1. open': '118.9900',
   '2. high': '118.9900',
   '3. low': '118.9800',
   '4. close': '118.9800',
   '5. volume': '547'},
  '2021-02-19 16:50:00': {'1. open': '118.9800',
   '2. high': '119.0000',
   '3. low': '118.9800',
   '4. close': '119.0000',
   '5. volume': '1400'},
  '2021-02-19 16:55:00': {'1. open': '119.0400',
   '2. high': '119.2000',
   '3. low': '119.0400',
   '4. close': '119.2000',
   '5. volume': '1166'},
  '2021-02-19 17:20:00': {'1. open': '119.0100',
   '2. high': '119.0500',
   '3. low': '119.0100',
   '4. close': '119.0500',
   '5. volume': '300'},
  '2021-02-19 17:25:00': {'1. open': '119.0500',
   '2. high': '119.0500',
   '3. low': '119.0000',
   '4. close': '119.0000',
   '5. volume': '7107'},
  '2021-02-19 17:35:00': {'1. open': '119.0400',
   '2. high': '119.0400',
   '3. low': '119.0000',
   '4. close': '119.0000',
   '5. volume': '706'},
  '2021-02-19 18:00:00': {'1. open': '119.0500',
   '2. high': '119.0500',
   '3. low': '119.0500',
   '4. close': '119.0500',
   '5. volume': '556'},
  '2021-02-19 18:05:00': {'1. open': '119.1500',
   '2. high': '119.1500',
   '3. low': '119.1500',
   '4. close': '119.1500',
   '5. volume': '353'},
  '2021-02-19 18:20:00': {'1. open': '119.0000',
   '2. high': '119.0000',
   '3. low': '119.0000',
   '4. close': '119.0000',
   '5. volume': '490'},
  '2021-02-19 18:25:00': {'1. open': '119.1000',
   '2. high': '119.1000',
   '3. low': '119.1000',
   '4. close': '119.1000',
   '5. volume': '701'},
  '2021-02-19 18:45:00': {'1. open': '119.1800',
   '2. high': '119.1800',
   '3. low': '119.1800',
   '4. close': '119.1800',
   '5. volume': '1250'}}}

In [ ]:
symbol = json_data['Meta Data']['2. Symbol']
interval = json_data['Meta Data']['4. Interval']
base = pd.DataFrame({'symbol': [symbol], 'interval': [interval], 'key': [1]})

In [ ]:
prices = json_data['Time Series (5min)']

In [ ]:
prices = pd.DataFrame(prices).T
prices.head()

                      1. open   2. high    3. low  4. close 5. volume
2021-02-19 18:45:00  119.1800  119.1800  119.1800  119.1800      1250
2021-02-19 18:25:00  119.1000  119.1000  119.1000  119.1000       701
2021-02-19 18:20:00  119.0000  119.0000  119.0000  119.0000       490
2021-02-19 18:05:00  119.1500  119.1500  119.1500  119.1500       353
2021-02-19 18:00:00  119.0500  119.0500  119.0500  119.0500       556

In [ ]:
#prices.reset_index(inplace=True)
prices['key'] = 1
prices.head()

                 index   1. open   2. high    3. low  4. close 5. volume  key
0  2021-02-19 18:45:00  119.1800  119.1800  119.1800  119.1800      1250    1
1  2021-02-19 18:25:00  119.1000  119.1000  119.1000  119.1000       701    1
2  2021-02-19 18:20:00  119.0000  119.0000  119.0000  119.0000       490    1
3  2021-02-19 18:05:00  119.1500  119.1500  119.1500  119.1500       353    1
4  2021-02-19 18:00:00  119.0500  119.0500  119.0500  119.0500       556    1

In [ ]:
result = pd.merge(base, prices, on ='key').drop("key", 1)
result.head()

  symbol interval                index  ...    3. low  4. close 5. volume
0    IBM     5min  2021-02-19 18:45:00  ...  119.1800  119.1800      1250
1    IBM     5min  2021-02-19 18:25:00  ...  119.1000  119.1000       701
2    IBM     5min  2021-02-19 18:20:00  ...  119.0000  119.0000       490
3    IBM     5min  2021-02-19 18:05:00  ...  119.1500  119.1500       353
4    IBM     5min  2021-02-19 18:00:00  ...  119.0500  119.0500       556

[5 rows x 8 columns]

In [ ]:
result.columns = ['symbol', 'interval', 'date', 'open', 'high', 'low', 'close', 'volume']
result.head()

  symbol interval                 date  ...       low     close volume
0    IBM     5min  2021-02-19 18:45:00  ...  119.1800  119.1800   1250
1    IBM     5min  2021-02-19 18:25:00  ...  119.1000  119.1000    701
2    IBM     5min  2021-02-19 18:20:00  ...  119.0000  119.0000    490
3    IBM     5min  2021-02-19 18:05:00  ...  119.1500  119.1500    353
4    IBM     5min  2021-02-19 18:00:00  ...  119.0500  119.0500    556

[5 rows x 8 columns]